In [4]:
person = {
    "first": "Corey",
    "last": "Shafer",
    "email": "CoreyMShafer@gmail.com"
}

In [5]:
people = {
    "first": ["Corey"],
     "last": ["Shafer"],
    "email": ["CoreyMShafer@gmail.com"]
}

In [6]:
people = {
    "first": ["Corey", "Jane", "John"],
     "last": ["Shafer", "Doe", "Doe"],
    "email": ["CoreyMShafer@gmail.com", "JaneDoe@gmaio.com", "JohnDoe@gmail.com"]
}

In [7]:
people["email"]

['CoreyMShafer@gmail.com', 'JaneDoe@gmaio.com', 'JohnDoe@gmail.com']

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(people)

In [10]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [11]:
df["email"]

0    CoreyMShafer@gmail.com
1         JaneDoe@gmaio.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [12]:
type(df["email"]) # series object
# series is a list of data, it has a lot of functionality
# a dataframe is a container for multiple of these series object
# email column is a series
# series also has an index

pandas.core.series.Series

In [13]:
df["email"]

0    CoreyMShafer@gmail.com
1         JaneDoe@gmaio.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [14]:
df.email # this also a way to get column but the above one is preferred
#because if the column name and method of a dataframe are same that could create problems

0    CoreyMShafer@gmail.com
1         JaneDoe@gmaio.com
2         JohnDoe@gmail.com
Name: email, dtype: object

# series object
# series is a list of data, it has a lot of functionality
# a dataframe is a container for multiple of these series object 
# email column is a series 
# series also has an index

In [21]:
# Access multiple columns
df[["last", "email"]]

     last                   email
0  Shafer  CoreyMShafer@gmail.com
1     Doe       JaneDoe@gmaio.com
2     Doe       JohnDoe@gmail.com

In [ ]:
# to see all the columns
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [ ]:
#loc and iloc
#iloc - integer location

df.iloc[0]

first                     Corey
last                     Shafer
email    CoreyMShafer@gmail.com
Name: 0, dtype: object

In [29]:
df.iloc[[0,2]]

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
2   John     Doe       JohnDoe@gmail.com

In [30]:
df.iloc[[0,2], 2]

0    CoreyMShafer@gmail.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [ ]:
#loc - search by label

In [33]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [34]:
df.loc[0]

first                     Corey
last                     Shafer
email    CoreyMShafer@gmail.com
Name: 0, dtype: object

In [35]:
df.loc[[0,1]]

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com

In [36]:
df.loc[[0,1], 'email']

0    CoreyMShafer@gmail.com
1         JaneDoe@gmaio.com
Name: email, dtype: object

In [37]:
df.loc[[0,1], ['email', "last"]]

                    email    last
0  CoreyMShafer@gmail.com  Shafer
1       JaneDoe@gmaio.com     Doe

In [38]:
df['email']

0    CoreyMShafer@gmail.com
1         JaneDoe@gmaio.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [ ]:
# setting email as the index for the dataframe
df.set_index('email')

                        first    last
email
CoreyMShafer@gmail.com  Corey  Shafer
JaneDoe@gmaio.com        Jane     Doe
JohnDoe@gmail.com        John     Doe

In [43]:
df # pandas doesn't do the changes in place so the index won't be updated in the original dataframe
# for that you have to specifically mention it

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [44]:
df.set_index('email', inplace=True)

In [ ]:
df # now the dataframe is changed

                        first    last
email
CoreyMShafer@gmail.com  Corey  Shafer
JaneDoe@gmaio.com        Jane     Doe
JohnDoe@gmail.com        John     Doe

In [47]:
df.index

Index(['CoreyMShafer@gmail.com', 'JaneDoe@gmaio.com', 'JohnDoe@gmail.com'], dtype='object', name='email')

In [50]:
df.loc["CoreyMShafer@gmail.com", "last"]

'Shafer'

In [ ]:
df.iloc[0] # this still works even though index changed

first     Corey
last     Shafer
Name: CoreyMShafer@gmail.com, dtype: object

In [ ]:
df.reset_index(inplace=True) # resets the index to 0,1 etc

In [17]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [ ]:

#FILTER BASICS
filt = (df["last"] == "Doe") # paranthesis for no reason
df[filt]

df[df["last"] == "Doe"] # this can also be done, but hard to read

  first last              email
1  Jane  Doe  JaneDoe@gmaio.com
2  John  Doe  JohnDoe@gmail.com

In [21]:
df.loc[filt]

  first last              email
1  Jane  Doe  JaneDoe@gmaio.com
2  John  Doe  JohnDoe@gmail.com

In [22]:
df.loc[filt, 'email']

1    JaneDoe@gmaio.com
2    JohnDoe@gmail.com
Name: email, dtype: object

In [26]:
filt = (df['last'] == "Doe") & (df["first"] == "John")
df[filt]

  first last              email
2  John  Doe  JohnDoe@gmail.com

In [27]:
df.loc[filt, "email"]

2    JohnDoe@gmail.com
Name: email, dtype: object

In [30]:
filt = (df['last'] == "Shafer") | (df["first"] == "John")
df.loc[filt, "email"]

0    CoreyMShafer@gmail.com
2         JohnDoe@gmail.com
Name: email, dtype: object

In [31]:
filt = (df['last'] == "Shafer") | (df["first"] == "John")
df.loc[~filt, "email"]

1    JaneDoe@gmaio.com
Name: email, dtype: object

How to update existing rows and columns in our data frame

In [ ]:
# map in series is used for substituting each value in the series with another value
# Substitute a couple of our first name
df["first"].map({"Corey": "Chris", "Jane": "Mary"})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [32]:
people = {
    "first": ["Corey", "Jane", "John"],
     "last": ["Shafer", "Doe", "Doe"],
    "email": ["CoreyMShafer@gmail.com", "JaneDoe@gmaio.com", "JohnDoe@gmail.com"]
}

In [ ]:
df = pd.DataFrame(people)

In [33]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [34]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [35]:
# updating first Name instead of "first"
df.columns = ['first_name', 'last_name', 'email']

In [36]:
df

  first_name last_name                   email
0      Corey    Shafer  CoreyMShafer@gmail.com
1       Jane       Doe       JaneDoe@gmaio.com
2       John       Doe       JohnDoe@gmail.com

In [ ]:
# upper case all of the columns here
df.columns = [x.upper() for x in df.columns]

In [38]:
df

  FIRST_NAME LAST_NAME                   EMAIL
0      Corey    Shafer  CoreyMShafer@gmail.com
1       Jane       Doe       JaneDoe@gmaio.com
2       John       Doe       JohnDoe@gmail.com

In [ ]:
# Remove the spaces and replace them with underscores
df.columns = df.columns.str.replace(' ', '_')

In [40]:
df

  FIRST_NAME LAST_NAME                   EMAIL
0      Corey    Shafer  CoreyMShafer@gmail.com
1       Jane       Doe       JaneDoe@gmaio.com
2       John       Doe       JohnDoe@gmail.com

In [ ]:
# Remove the underscores and replace them with spaces
df.columns = df.columns.str.replace('-', ' ')

In [42]:
df.columns = [x.lower() for x in df.columns]

In [43]:
df

  first_name last_name                   email
0      Corey    Shafer  CoreyMShafer@gmail.com
1       Jane       Doe       JaneDoe@gmaio.com
2       John       Doe       JohnDoe@gmail.com

In [46]:
# what if we only want to change a some columns name
df.rename(columns={"first_name": "first", "last_name": "last"}, inplace=True)

In [47]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

Updating the data in the rows

In [49]:
df.loc[2] = ["John", "Smith", "JohnSmith@gamil.com"]

In [50]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John   Smith     JohnSmith@gamil.com

In [53]:
# more efficient way - the above won't work if there are many rows
df.loc[2, ["last", "email"]] = ["Doe", "JohnDoe@gmail.com"]

In [54]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [ ]:
# change a single value
df.loc[1, ["last"]] = ["Smith"]

In [57]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane   Smith       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [ ]:
# Pandas also have another indexer called at - for changing single value
df.at[1, "last"] = "Doe"

In [59]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John     Doe       JohnDoe@gmail.com

In [63]:
# when people try to change value without using indexers like .loc or .at
filt = (df["email"]== "JohnDoe@gmail.com")
df.loc[filt, "last"] = "Smith"
# when you are setting values use indexers

In [64]:
df

   first    last                   email
0  Corey  Shafer  CoreyMShafer@gmail.com
1   Jane     Doe       JaneDoe@gmaio.com
2   John   Smith       JohnDoe@gmail.com

How would we updte multiple rows of data

In [ ]:
# Change of the email addresses so that they are lower case
df["email"] = df['email'].str.lower()

In [67]:
df

   first    last                   email
0  Corey  Shafer  coreymshafer@gmail.com
1   Jane     Doe       janedoe@gmaio.com
2   John   Smith       johndoe@gmail.com

In [ ]:
# more advanced - 4 popular methods
# apply, map, applymap, replace

# apply - used for calling a function on our values - can work on series or data frame
# apply working on a series - apply a function to every value in our series

df['email'].apply(len)

0    22
1    17
2    17
Name: email, dtype: int64

In [ ]:
def update_email(email):
    return email.upper()
# lets update this function to our email column

df["email"].apply(update_email)

0    COREYMSHAFER@GMAIL.COM
1         JANEDOE@GMAIO.COM
2         JOHNDOE@GMAIL.COM
Name: email, dtype: object

In [70]:
df["email"] = df["email"].apply(update_email)

In [71]:
df

   first    last                   email
0  Corey  Shafer  COREYMSHAFER@GMAIL.COM
1   Jane     Doe       JANEDOE@GMAIO.COM
2   John   Smith       JOHNDOE@GMAIL.COM

In [ ]:
# instead you can also use a lamda function inside the apply function
df["email"] = df["email"].apply(lambda x: x.lower())

In [73]:
df

   first    last                   email
0  Corey  Shafer  coreymshafer@gmail.com
1   Jane     Doe       janedoe@gmaio.com
2   John   Smith       johndoe@gmail.com

In [74]:
# how apply works with dataframe? Each row or column of that dataframe
df["email"].apply(len)

0    22
1    17
2    17
Name: email, dtype: int64

In [ ]:
df.apply(len)
# number of rows in each columns

first    3
last     3
email    3
dtype: int64

In [76]:
df.apply(len, axis="columns")

0    3
1    3
2    3
dtype: int64

In [ ]:
# grab minimum value from each column  # way more usefull when your dataframe contains numerical data
df.apply(pd.Series.min)

first                     Corey
last                        Doe
email    coreymshafer@gmail.com
dtype: object

In [ ]:
df.apply(lambda x: x.min()) # way more usefull when your dataframe contains numerical data

first                     Corey
last                        Doe
email    coreymshafer@gmail.com
dtype: object

Running apply() on a series applies a function to every value in the series 
Running apply() to a dataframe applies a function to every series in the dataframe

In [ ]:
# Apply map is used for applying changes to every element in the dataframe
# Apply map only works on dataframes, series objects don't have applymap method
df.applymap(len)

/var/folders/0j/x5597mg56tb5rt4ttpllf52h0000gn/T/ipykernel_19202/1630752062.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      5     6     22
1      4     3     17
2      4     5     17

In [ ]:
# df.applymap(str.lower)
# after pandas 2.1 the apply map changed to map
df.map(str.lower)

   first    last                   email
0  corey  shafer  coreymshafer@gmail.com
1   jane     doe       janedoe@gmaio.com
2   john   smith       johndoe@gmail.com

In [ ]:
# map in series is used for substituting each value in the series with another value
# Substitute a couple of our first name
df["first"].map({"Corey": "Chris", "Jane": "Mary"})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [85]:
df

   first    last                   email
0  Corey  Shafer  coreymshafer@gmail.com
1   Jane     Doe       janedoe@gmaio.com
2   John   Smith       johndoe@gmail.com